---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalLinkType.RotationZ
source: html/a67e8e64-accc-ec59-91e7-ae4ffb77fc3e.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLinkType.RotationZ Property

Fixity of rotation around Z.

## Syntax (C#)
```csharp
public AnalyticalFixityState RotationZ { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The fixity state rotationZ is not valid for Analytical Link Type parameters.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration